Конфигурация/Catalogs/ГруппыВидовОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыВидовОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ВидыОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ГруппыВидовОпераций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, , , Отказ) Тогда
		Возврат;
	КонецЕсли;
	                  
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ВидыОпераций.Загрузить(ЭтаФорма.ВидыОпераций.Выгрузить(Новый Структура("Выбран", Истина), "ВидОперации, ЦельРасчета"));
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	УстановитьФлажки(ЭтаФорма, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	УстановитьФлажки(ЭтаФорма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьОперацииБэкОфиса(Команда)

	ОтметитьОперацииПредопределенногоНабораНаСервере("ОперацииБэкОфиса");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьОперацииНеПопавшиеНиВОднуГруппу(Команда)

	ОтметитьОперацииПредопределенногоНабораНаСервере("ОперацииНеПопавшиеНиВОднуГруппу");

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	ЗаполнитьВидыОпераций();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлажки(Форма, ЗначениеФлажка)
	Для Каждого СтрокаВидаОперации Из Форма.ВидыОпераций Цикл
		СтрокаВидаОперации.Выбран = ЗначениеФлажка; 		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОпераций()
	
	// Получим все документы конфигурации
	ВсеВидыОпераций = Новый ТаблицаЗначений;
	ВсеВидыОпераций.Колонки.Добавить("ВидОперации",					Метаданные.Справочники.ГруппыВидовОпераций.ТабличныеЧасти.ВидыОпераций.Реквизиты.ВидОперации.Тип);
	ВсеВидыОпераций.Колонки.Добавить("ПредставлениеВидаОперации",	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200)));
	ВсеВидыОпераций.Колонки.Добавить("ЕстьРеквизитЦельРасчета",		Новый ОписаниеТипов("Булево"));
	
	Если Объект.Родитель = Справочники.ГруппыВидовОпераций.ОтчетностьЦБ Тогда
		Макет = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетностьЦБ").ПолучитьМакет("ВидимостьРеквизитов");
		Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
			ВидОперации = ВсеВидыОпераций.Добавить();
			ВидОперации.ВидОперации					= Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
			ВидОперации.ПредставлениеВидаОперации	= Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		КонецЦикла;
		
	Иначе
	
		Для Каждого МетаДокумент Из Метаданные.Документы Цикл
			ВидОперации = ВсеВидыОпераций.Добавить();
			ВидОперации.ВидОперации					= Документы[МетаДокумент.Имя].ПустаяСсылка();
			ВидОперации.ПредставлениеВидаОперации	= МетаДокумент.Синоним;
			ВидОперации.ЕстьРеквизитЦельРасчета		= (МетаДокумент.Реквизиты.Найти("ЦельРасчета") <> Неопределено);
		КонецЦикла;
		
		ВидОперации = ВсеВидыОпераций.Добавить();
		ВидОперации.ВидОперации					= Метаданные.РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.Имя;
		ВидОперации.ПредставлениеВидаОперации	= Метаданные.РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.Синоним;
	
	КонецЕсли;
	
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеВидыОпераций.ВидОперации КАК ВидОперации,
		|	_ВсеВидыОпераций.ПредставлениеВидаОперации КАК ПредставлениеВидаОперации,
		|	_ВсеВидыОпераций.ЕстьРеквизитЦельРасчета КАК ЕстьРеквизитЦельРасчета
		|ПОМЕСТИТЬ _ВсеВидыОпераций
		|ИЗ
		|	&ВсеВидыОпераций КАК _ВсеВидыОпераций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВидыОперацийТекущейГруппы.ВидОперации КАК ВидОперации,
		|	_ВидыОперацийТекущейГруппы.ЦельРасчета КАК ЦельРасчета
		|ПОМЕСТИТЬ _ВидыОперацийТекущейГруппы
		|ИЗ
		|	&ВидыОперацийТекущейГруппы КАК _ВидыОперацийТекущейГруппы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеВидыОпераций.ПредставлениеВидаОперации КАК ПредставлениеВидаОперации,
		|	_ВсеВидыОпераций.ВидОперации КАК ВидОперации,
		|	ЦелиРасчета.Ссылка КАК ЦельРасчета,
		|	_ВидыОперацийТекущейГруппы.ВидОперации ЕСТЬ НЕ NULL  КАК Выбран
		|ИЗ
		|	_ВсеВидыОпераций КАК _ВсеВидыОпераций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦелиРасчета КАК ЦелиРасчета
		|		ПО (_ВсеВидыОпераций.ЕстьРеквизитЦельРасчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыОперацийТекущейГруппы КАК _ВидыОперацийТекущейГруппы
		|		ПО (_ВидыОперацийТекущейГруппы.ВидОперации = _ВсеВидыОпераций.ВидОперации)
		|			И (_ВидыОперацийТекущейГруппы.ЦельРасчета = ЦелиРасчета.Ссылка
		|				ИЛИ НЕ _ВсеВидыОпераций.ЕстьРеквизитЦельРасчета)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ВсеВидыОпераций.ПредставлениеВидаОперации,
		|	ЦелиРасчета.Наименование");
	
	Запрос.УстановитьПараметр("ВсеВидыОпераций", ВсеВидыОпераций);
	Запрос.УстановитьПараметр("ВидыОперацийТекущейГруппы", Объект.ВидыОпераций.Выгрузить(, "ВидОперации, ЦельРасчета"));
	
	ЭтаФорма.ВидыОпераций.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Элементы.ВидВнешнейОперации.СписокВыбора.Очистить();
	Для Каждого СтрокаВидаОперации Из ЭтаФорма.ВидыОпераций Цикл
		Элементы.ВидВнешнейОперации.СписокВыбора.Добавить(СтрокаВидаОперации.ВидОперации, СтрокаВидаОперации.ПредставлениеВидаОперации);
		Если СтрокаВидаОперации.Выбран Тогда
			ЭтаФорма.ВидВнешнейОперации = СтрокаВидаОперации.ВидОперации;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОперацииПредопределенногоНабораНаСервере(Набор)
	
	Если Набор = "ОперацииБэкОфиса" Тогда
		
		ДополнительныеОперацииБэкОфиса = Новый Массив;
		ДополнительныеОперацииБэкОфиса.Добавить(Метаданные.РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.Имя);

		Для Каждого СтрокаВидаОперации Из ЭтаФорма.ВидыОпераций Цикл
			Если ТипЗнч(СтрокаВидаОперации.ВидОперации) <> Тип("Строка") Тогда
				СтрокаВидаОперации.Выбран = (Метаданные.Перечисления.ВидыОперацийБэкОфиса.ЗначенияПеречисления.Найти(СтрокаВидаОперации.ВидОперации.Метаданные().Имя) <> Неопределено);
			Иначе
				СтрокаВидаОперации.Выбран = (ДополнительныеОперацииБэкОфиса.Найти(СтрокаВидаОперации.ВидОперации) <> Неопределено);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли Набор = "ОперацииНеПопавшиеНиВОднуГруппу" Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ГруппыВидовОперацийВидыОпераций.ВидОперации КАК ВидОперации,
			|	ГруппыВидовОперацийВидыОпераций.ЦельРасчета КАК ЦельРасчета			
			|ИЗ
			|	Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ГруппыВидовОперацийВидыОпераций
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
			|		ПО ГруппыВидовОперацийВидыОпераций.Ссылка = ГруппыВидовОпераций.Ссылка
			|ГДЕ
			|	ГруппыВидовОпераций.ПометкаУдаления = ЛОЖЬ");
		
		ЗанятыеОперации = Запрос.Выполнить().Выгрузить();		
		
		Для Каждого СтрокаВидаОперации Из ЭтаФорма.ВидыОпераций Цикл
			СтрокаВидаОперации.Выбран = (ЗанятыеОперации.НайтиСтроки(Новый Структура("ВидОперации, ЦельРасчета", СтрокаВидаОперации.ВидОперации, СтрокаВидаОперации.ЦельРасчета)).Количество() = 0);
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;

	ГруппаОтчетностьЦБ = ПредопределенноеЗначение("Справочник.ГруппыВидовОпераций.ОтчетностьЦБ");
	
	Элементы.ГруппаВидыОпераций.Видимость = НЕ (ДанныеОбъекта.Ссылка = ГруппаОтчетностьЦБ ИЛИ ДанныеОбъекта.Родитель = ГруппаОтчетностьЦБ);
	Элементы.ВидВнешнейОперации.Видимость = (ДанныеОбъекта.Родитель = ГруппаОтчетностьЦБ);
	
КонецПроцедуры


&НаКлиенте
Процедура ВидВнешнейОперацииПриИзменении(Элемент)
	
	Для Каждого СтрокаВидаОперации Из ЭтаФорма.ВидыОпераций Цикл
		СтрокаВидаОперации.Выбран = (ЭтаФорма.ВидВнешнейОперации = СтрокаВидаОперации.ВидОперации);
		Если ЭтаФорма.ВидВнешнейОперации = СтрокаВидаОперации.ВидОперации Тогда
			Объект.Наименование = СтрокаВидаОперации.ПредставлениеВидаОперации;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	ЗаполнитьВидыОпераций();
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры
